meeting/agenda/2025/01-14.org
:PROPERTIES:
:ID:       9FFDAD8D-CD6E-4816-85C2-DEF0379FF120
:END:
#+title: QT4 CG Meeting 105 Agenda 2025-01-14
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 11:00EST) 

The [[https://us06web.zoom.us/j/83199966275?pwd=SmN6V0RhUGdSTHFHZkd6cjgxVEY2QT09][Zoom meeting]] ID is 831 9996 6275; the passcode is 707664.

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for more details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2025/01-07.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 14 January 2025. The following meeting is scheduled
for 21 January 2025. 

** Review of open action items [0/9]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-080-07: NW to update the build instructions in the README
+ [ ] QT4CG-082-02: DN to work with MK to come to agreement on the fn:ranks proposal
+ [ ] QT4CG-088-01: NW to consider how best to add a dedication to MSM.
+ [ ] QT4CG-088-04: [Someone] needs to update the processing model diagram needs vis-a-vis the static typing feature
+ [ ] QT4CG-089-01: CG to draft a PR that attempts to resolve the operators described in #755 to a smaller number of orthogonal choices.
+ [ ] QT4CG-097-03: DN to proposal an axis for accessing the siblings of a node.
+ [ ] QT4CG-103-01: MK to add an example of showing all the properties for an untyped node.
+ [ ] QT4CG-104-01: MK to improve the wording around ~trim-whitespace~ wrt spaces outside the quoted string
+ [ ] QT4CG-103-02: MK to research alternative names for ~divide-decimals~.

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-1617][#1617]]: 1606 Drop named item types, refine named record types, esp in XSLT
+ PR [[https://qt4cg.org/dashboard/#pr-1587][#1587]]: 557 Add fn:binary-resource
+ PR [[https://qt4cg.org/dashboard/#pr-1296][#1296]]: 982 Rewrite of scan-left and scan-right
+ PR [[https://qt4cg.org/dashboard/#pr-1283][#1283]]: 77b Update expressions
+ PR [[https://qt4cg.org/dashboard/#pr-1062][#1062]]: 150bis revised proposal for fn:ranks
+ PR [[https://qt4cg.org/dashboard/#pr-1227][#1227]]: 150 PR resubmission for fn ranks

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-1695][#1695]]: 1284 Define streamability of distinct-ordered-nodes
+ PR [[https://qt4cg.org/dashboard/#pr-1693][#1693]]: 1683 Extend xpath-functions schema with CSV components
+ PR [[https://qt4cg.org/dashboard/#pr-1690][#1690]]: 1688 In "implementation-defined" appendix, fix absent generated link
+ PR [[https://qt4cg.org/dashboard/#pr-1673][#1673]]: 1407 TOC structure for types

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1006][#1006]]: regular expression addition - word boundaries
+ Issue [[https://github.com/qt4cg/qtspecs/issues/490][#490]]: Control over schema validation in parse-xml(), doc(), etc.
+ Issue [[https://github.com/qt4cg/qtspecs/issues/108][#108]]: Template match using values of [tunnel] parameters

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-1609][#1609]]: 1651 Ordered Maps
+ PR [[https://qt4cg.org/dashboard/#pr-1677][#1677]]: 1675 Fixes for CSV parsing
+ PR [[https://qt4cg.org/dashboard/#pr-1686][#1686]]: 1685 Pipeline Operator
+ PR [[https://qt4cg.org/dashboard/#pr-1687][#1687]]: 1672 array:values, map:values: Alternatives
+ PR [[https://qt4cg.org/dashboard/#pr-1689][#1689]]: 1684 Composite merge keys; current-merge-key-array function
+ PR [[https://qt4cg.org/dashboard/#pr-1692][#1692]]: 1680 Fix switch syntax ambiguity
+ PR [[https://qt4cg.org/dashboard/#pr-1694][#1694]]: 1632 Add xsl:map/@select
+ PR [[https://qt4cg.org/dashboard/#pr-1696][#1696]]: 1136 Optional names in typed function types

*** Required for V4.0
:PROPERTIES:
:CUSTOM_ID: required-40
:END:

The following issues are labeled “required for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1252][#1252]]: Add a new function `fn:html-doc`
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1240][#1240]]: $sequence-of-maps ? info()
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1238][#1238]]: XSLT on-no-match="shallow-copy-all" - revised rules
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1127][#1127]]: Binary resources
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1045][#1045]]: Functions to manage namespace usage
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1021][#1021]]: Extend `fn:doc`, `fn:collection` and `fn:uri-collection` with options maps
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1011][#1011]]: fn:transform() improvements
+ Issue [[https://github.com/qt4cg/qtspecs/issues/986][#986]]: Numeric Comparisons
+ Issue [[https://github.com/qt4cg/qtspecs/issues/967][#967]]: XPath Appendix I: Comparisons
+ Issue [[https://github.com/qt4cg/qtspecs/issues/826][#826]]: Arrays: Representation of single members of an array
+ Issue [[https://github.com/qt4cg/qtspecs/issues/748][#748]]: Parse functions: consistency
+ Issue [[https://github.com/qt4cg/qtspecs/issues/675][#675]]: XSLT streaming rules for new constructs
+ Issue [[https://github.com/qt4cg/qtspecs/issues/501][#501]]: Error handling: Rethrow errors; finally block
+ Issue [[https://github.com/qt4cg/qtspecs/issues/490][#490]]: Control over schema validation in parse-xml(), doc(), etc.
+ Issue [[https://github.com/qt4cg/qtspecs/issues/407][#407]]: XSLT-specific context properties used in function items
+ Issue [[https://github.com/qt4cg/qtspecs/issues/272][#272]]: Setting parameter values in xsl:use-package

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** PR #1686: 1685 Pipeline Operator
:PROPERTIES:
:CUSTOM_ID: pr-1686
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1686][#1686]]
** PR #1677: 1675 Fixes for CSV parsing
:PROPERTIES:
:CUSTOM_ID: pr-1677
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1677][#1677]]
** PR #1687: 1672 array:values, map:values: Alternatives
:PROPERTIES:
:CUSTOM_ID: pr-1687
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1687][#1687]]
** PR #1692: 1680 Fix switch syntax ambiguity
:PROPERTIES:
:CUSTOM_ID: pr-1692
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1692][#1692]]
** PR #1696: 1136 Optional names in typed function types
:PROPERTIES:
:CUSTOM_ID: pr-1696
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1696][#1696]]
** PR #1609: 1651 Ordered Maps
:PROPERTIES:
:CUSTOM_ID: pr-1609
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1609][#1609]]
** PR #1689: 1684 Composite merge keys; current-merge-key-array function
:PROPERTIES:
:CUSTOM_ID: pr-1689
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1689][#1689]]
** PR #1694: 1632 Add xsl:map/@select
:PROPERTIES:
:CUSTOM_ID: pr-1694
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1694][#1694]]

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
