meeting/agenda/2025/01-14.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 105 Agenda 2025-01-14</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 105 Agenda 2025-01-14</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 11:00EST) 
</p>

<p>
The <a href="https://us06web.zoom.us/j/83199966275?pwd=SmN6V0RhUGdSTHFHZkd6cjgxVEY2QT09">Zoom meeting</a> ID is 831 9996 6275; the passcode is 707664.
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for more details.
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2025/01-07.html">the previous meeting</a>.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 14 January 2025. The following meeting is scheduled
for 21 January 2025. 
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[0/9]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-080-07: NW to update the build instructions in the README</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-082-02: DN to work with MK to come to agreement on the fn:ranks proposal</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-088-01: NW to consider how best to add a dedication to MSM.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-088-04: [Someone] needs to update the processing model diagram needs vis-a-vis the static typing feature</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-089-01: CG to draft a PR that attempts to resolve the operators described in #755 to a smaller number of orthogonal choices.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-097-03: DN to proposal an axis for accessing the siblings of a node.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-103-01: MK to add an example of showing all the properties for an untyped node.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-104-01: MK to improve the wording around <code>trim-whitespace</code> wrt spaces outside the quoted string</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-103-02: MK to research alternative names for <code>divide-decimals</code>.</li>
</ul>
</div>
</div>

<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
</div>

<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1617">#1617</a>: 1606 Drop named item types, refine named record types, esp in XSLT</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1587">#1587</a>: 557 Add fn:binary-resource</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1296">#1296</a>: 982 Rewrite of scan-left and scan-right</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1283">#1283</a>: 77b Update expressions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1062">#1062</a>: 150bis revised proposal for fn:ranks</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1227">#1227</a>: 150 PR resubmission for fn ranks</li>
</ul>
</div>
</div>

<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1695">#1695</a>: 1284 Define streamability of distinct-ordered-nodes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1693">#1693</a>: 1683 Extend xpath-functions schema with CSV components</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1690">#1690</a>: 1688 In "implementation-defined" appendix, fix absent generated link</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1673">#1673</a>: 1407 TOC structure for types</li>
</ul>
</div>
</div>

<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1006">#1006</a>: regular expression addition - word boundaries</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/490">#490</a>: Control over schema validation in parse-xml(), doc(), etc.</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/108">#108</a>: Template match using values of [tunnel] parameters</li>
</ul>
</div>
</div>

<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.4.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1609">#1609</a>: 1651 Ordered Maps</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1677">#1677</a>: 1675 Fixes for CSV parsing</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1686">#1686</a>: 1685 Pipeline Operator</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1687">#1687</a>: 1672 array:values, map:values: Alternatives</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1689">#1689</a>: 1684 Composite merge keys; current-merge-key-array function</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1692">#1692</a>: 1680 Fix switch syntax ambiguity</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1694">#1694</a>: 1632 Add xsl:map/@select</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1696">#1696</a>: 1136 Optional names in typed function types</li>
</ul>
</div>
</div>

<div id="outline-container-required-40" class="outline-4">
<h4 id="required-40"><span class="section-number-4">1.6.5.</span> Required for V4.0</h4>
<div class="outline-text-4" id="text-required-40">
<p>
The following issues are labeled “required for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1252">#1252</a>: Add a new function `fn:html-doc`</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1240">#1240</a>: $sequence-of-maps ? info()</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1238">#1238</a>: XSLT on-no-match="shallow-copy-all" - revised rules</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1127">#1127</a>: Binary resources</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1045">#1045</a>: Functions to manage namespace usage</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1021">#1021</a>: Extend `fn:doc`, `fn:collection` and `fn:uri-collection` with options maps</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1011">#1011</a>: fn:transform() improvements</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/986">#986</a>: Numeric Comparisons</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/967">#967</a>: XPath Appendix I: Comparisons</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/826">#826</a>: Arrays: Representation of single members of an array</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/748">#748</a>: Parse functions: consistency</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/675">#675</a>: XSLT streaming rules for new constructs</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/501">#501</a>: Error handling: Rethrow errors; finally block</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/490">#490</a>: Control over schema validation in parse-xml(), doc(), etc.</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/407">#407</a>: XSLT-specific context properties used in function items</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/272">#272</a>: Setting parameter values in xsl:use-package</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-pr-1686" class="outline-3">
<h3 id="pr-1686"><span class="section-number-3">2.1.</span> PR #1686: 1685 Pipeline Operator</h3>
<div class="outline-text-3" id="text-pr-1686">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1686">#1686</a>
</p>
</div>
</div>
<div id="outline-container-pr-1677" class="outline-3">
<h3 id="pr-1677"><span class="section-number-3">2.2.</span> PR #1677: 1675 Fixes for CSV parsing</h3>
<div class="outline-text-3" id="text-pr-1677">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1677">#1677</a>
</p>
</div>
</div>
<div id="outline-container-pr-1687" class="outline-3">
<h3 id="pr-1687"><span class="section-number-3">2.3.</span> PR #1687: 1672 array:values, map:values: Alternatives</h3>
<div class="outline-text-3" id="text-pr-1687">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1687">#1687</a>
</p>
</div>
</div>
<div id="outline-container-pr-1692" class="outline-3">
<h3 id="pr-1692"><span class="section-number-3">2.4.</span> PR #1692: 1680 Fix switch syntax ambiguity</h3>
<div class="outline-text-3" id="text-pr-1692">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1692">#1692</a>
</p>
</div>
</div>
<div id="outline-container-pr-1696" class="outline-3">
<h3 id="pr-1696"><span class="section-number-3">2.5.</span> PR #1696: 1136 Optional names in typed function types</h3>
<div class="outline-text-3" id="text-pr-1696">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1696">#1696</a>
</p>
</div>
</div>
<div id="outline-container-pr-1609" class="outline-3">
<h3 id="pr-1609"><span class="section-number-3">2.6.</span> PR #1609: 1651 Ordered Maps</h3>
<div class="outline-text-3" id="text-pr-1609">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1609">#1609</a>
</p>
</div>
</div>
<div id="outline-container-pr-1689" class="outline-3">
<h3 id="pr-1689"><span class="section-number-3">2.7.</span> PR #1689: 1684 Composite merge keys; current-merge-key-array function</h3>
<div class="outline-text-3" id="text-pr-1689">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1689">#1689</a>
</p>
</div>
</div>
<div id="outline-container-pr-1694" class="outline-3">
<h3 id="pr-1694"><span class="section-number-3">2.8.</span> PR #1694: 1632 Add xsl:map/@select</h3>
<div class="outline-text-3" id="text-pr-1694">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1694">#1694</a>
</p>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
